TensorFlowFoam/misc/Other_models/ML_KO/ML_KO_Run/0/gradu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      yygradu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
20540
(
225158
0.286318
722320
2.416
608205
1.34085
753781
1.96483
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
540852
1.70834e+06
1.44024e+06
1.782e+06
2.3884e+06
3.19167e+06
4.14706e+06
5.16489e+06
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
17.3462
5.06351
1.04427
1.23587
1.46275
1.73143
2.04967
2.42665
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
218
(
2.29758e-28
2.09566e-28
2.09312e-28
2.09692e-28
2.10187e-28
2.10782e-28
2.11454e-28
2.12193e-28
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
266
(
2.42177e-28
2.23031e-28
2.2293e-28
2.2335e-28
2.23879e-28
2.2451e-28
2.25224e-28
2.26009e-28
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
