TensorFlowFoam/misc/Other_models/ML_KO/ML_KO_Run/0/gradv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      yygradv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
20540
(
129.468
2.24342e-05
191.367
0.000341297
127.551
0.000798637
154.662
0.00182912
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
304.059
449.43
299.556
363.227
362.849
362.261
361.307
359.737
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
9.41334e-08
2.79489e-07
4.14134e-07
5.76577e-07
7.53595e-07
9.80207e-07
1.2681e-06
1.63063e-06
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
218
(
3.86461e-39
1.33824e-41
2.2099e-42
4.18365e-42
7.47933e-42
1.02466e-41
1.41087e-41
1.73515e-41
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
266
(
6.76444e-39
1.5064e-42
5.17148e-42
6.37824e-42
5.58388e-42
5.88348e-42
5.66127e-42
6.61454e-42
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
