TensorFlowFoam/misc/Other_models/ML_KO/ML_KO_Run/0/vortz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      vortz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
20540
(
-2576.48
-18.2545
-4626.98
-27.5225
-4244.84
-20.4675
-4726.92
-24.7486
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
-2576.48
-4626.95
-4244.79
-4726.84
-5478.69
-6338.8
-7229.8
-8071.6
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
-120.695
-65.2097
-29.6135
-32.2154
-35.0471
-38.1291
-41.4837
-45.1352
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
218
(
15.1578
14.4764
14.4676
14.4807
14.4978
14.5183
14.5415
14.5668
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
266
(
-15.5621
-14.9342
-14.9309
-14.9449
-14.9626
-14.9837
-15.0075
-15.0336
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
